const verses = {
  joy: [
    "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّـهِ",
    "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "فَإِنَّ مَعِيَ رَبِّي سَيَهْدِينِ",
    "وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ",
    "وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
    "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
    "وَفَرِحُوا بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ",
    "وَعَسَىٰ رَبُّكُمْ أَن يَرْحَمَكُمْ"
  ],

  sad: [
    "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ",
    "فَصَبْرٌ جَمِيلٌ",
    "إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ",
    "إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
    "وَبَشِّرِ الصَّابِرِينَ",
    "اللَّهُ لَطِيفٌ بِعِبَادِهِ",
    "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "وَأَفَوِّضُ أَمْرِي إِلَى اللَّهِ"
  ],

  anger: [
    "وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ",
    "ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ",
    "وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
    "وَقُولُوا لِلنَّاسِ حُسْنًا",
    "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ",
    "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ",
    "فَاصْفَحِ الصَّفْحَ الْجَمِيلَ",
    "وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا",
    "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ",
    "إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ",
    "وَدَفْعُ السَّيِّئَةِ بِالْحَسَنَةِ",
    "وَاعْفُوا وَاصْفَحُوا"
  ],

  peace: [
    "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "سَلَامٌ قَوْلًا مِن رَّبٍّ رَّحِيمٍ",
    "وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
    "فَسَيَكْفِيكَهُمُ اللَّهُ",
    "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ",
    "وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ",
    "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ",
    "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ",
    "فَاذْكُرُونِي أَذْكُرْكُمْ",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا"
  ]
};

function show(type) {
  const list = verses[type];

  // اختيار آية عشوائية كل مرة
  const randomVerse = list[Math.floor(Math.random() * list.length)];

  const result = document.getElementById("result");

  result.innerHTML = `
    <div class="box">
      ${randomVerse}
    </div>
  `;
}