const verses = {
  joy: [
    "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّـهِ",
    "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ",
    "وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
    "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَفَرِحُوا بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ",
    "وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ"
  ],

  sad: [
    "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "فَصَبْرٌ جَمِيلٌ",
    "إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ",
    "وَبَشِّرِ الصَّابِرِينَ",
    "اللَّهُ لَطِيفٌ بِعِبَادِهِ",
    "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ",
    "إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ"
  ],

  anger: [
    "وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ",
    "ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ",
    "وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
    "وَقُولُوا لِلنَّاسِ حُسْنًا",
    "إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ",
    "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ",
    "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ",
    "فَاصْفَحِ الصَّفْحَ الْجَمِيلَ",
    "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ",
    "وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا"
  ],

  peace: [
    "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "سَلَامٌ قَوْلًا مِن رَّبٍّ رَّحِيمٍ",
    "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ",
    "اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ",
    "وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
    "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ",
    "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ",
    "فَسَيَكْفِيكَهُمُ اللَّهُ"
  ]
};

function show(type) {
  const list = verses[type];

  const randomIndex = Math.floor(Math.random() * list.length);
  const random = list[randomIndex];

  const result = document.getElementById("result");

  result.innerHTML = `<div class="box fade">${random}</div>`;
}
function createHeart() {
  const heart = document.createElement("div");
  heart.innerHTML = "💖";
  heart.style.position = "absolute";
  heart.style.left = Math.random() * 100 + "vw";
  heart.style.fontSize = (12 + Math.random() * 25) + "px";
  heart.style.opacity = Math.random();
  heart.style.top = "100vh";
  heart.style.animation = `float ${3 + Math.random() * 5}s linear`;

  document.body.appendChild(heart);

  setTimeout(() => heart.remove(), 6000);
}

setInterval(createHeart, 250);